feat: modified simulation logic for evaluators, Ui refinements,. Added How it works page.
